In [17]:
import pandas as pd
import pandasql as ps

In [18]:
agenda = pd.read_csv('data/agenda.csv')

agenda

# https://stackoverflow.com/questions/45865608/executing-an-sql-query-over-a-pandas-dataset

                     Name    Phone Number        date  genre
0    Kimberlee Turlington   039 298-72-30   2006-3-30      1
1          Miguel Eveland     032-2659094   1971-9-22      1
2             Audrie Smid  03758295-10 32   2009-1-16      3
3        Antonia Maslanka  00594-83-34 93   1999-7-25      1
4           Val Hoffmeyer   001-859-07-84   2008-7-21      2
..                    ...             ...         ...    ...
995           Rene Rubner    006-42958-57   1988-4-31      2
996           Robin Repke      0704708286   1999-2-31      1
997            Nilda Mees     019 4826 02  1988-12-15      2
998            Shasta Bou  06701-087 2 28    1980-9-8      3
999          Kasey Pocock    0926-37674 0   1994-2-20      1

[1000 rows x 4 columns]

In [22]:

q1 = """SELECT Name FROM agenda WHERE genre=1"""

print(ps.sqldf(q1, locals()))

                     Name
0    Kimberlee Turlington
1          Miguel Eveland
2        Antonia Maslanka
3             Reva Larger
4            Cheri Batson
..                    ...
378             Jen Behan
379      Ricky Engelhaupt
380              Del Vela
381           Robin Repke
382          Kasey Pocock

[383 rows x 1 columns]

In [28]:
q2 = """SELECT Name FROM agenda WHERE date LIKE '19%'"""

print(ps.sqldf(q2, locals()))

                 Name
0      Miguel Eveland
1    Antonia Maslanka
2       Fleta Mckiney
3         Reva Larger
4       Shelby Prator
..                ...
713       Rene Rubner
714       Robin Repke
715        Nilda Mees
716        Shasta Bou
717      Kasey Pocock

[718 rows x 1 columns]